{
  "data": [
    {
      "name": "heading",
      "body": "Motional Electromotive force"
    },
    {
      "name": "image",
      "body": "/assets/electromagnetic-induction/image52.png",
      "alt": "image52"
    },
    {
      "name": "paragraph",
      "body": "Let us consider a straight conductor moving in a uniform and time-independent magnetic field. The figure shows a rectangular conductor \\( PQRS \\) in which the conductor \\( PQ \\) is free to move. The rod \\( PQ \\) is moved towards the left with a constant velocity \\( v \\) as shown in the figure. Assume that there is no loss of energy due to friction. \\( PQRS \\) forms a closed circuit enclosing an area that changes as \\( PQ \\) moves. It is placed in a uniform magnetic field \\( B \\) which is perpendicular to the plane of this system. If the length \\( RQ = x \\) and \\( RS = l \\), the magnetic flux \\( \\Phi_B \\) enclosed by the loop \\( PQRS \\) will be"
    },
    {
      "name": "expression",
      "body": "\\( \\Phi_B = Blx \\)"
    },
    {
      "name": "paragraph",
      "body": "Since \\( x \\) is changing with time, the rate of change of flux \\( \\Phi_B \\) will induce an emf given by:"
    },
    {
      "name": "expression",
      "body": "\\[ \\varepsilon = -{{d\\Phi_B}\\over{dt}} = -Bl {{d}\\over{dt}}(x) = -Bl {{d}\\over{dt}}(vt) = Blv \\]"
    },
    {
      "name": "paragraph",
      "body": "where we have used \\( 1{{dx}\\over{dt}} = -v \\), which is the speed of the conductor \\( PQ \\). The induced emf \\( Blv \\) is called motional emf. Thus, we are able to produce induced emf by moving a conductor instead of varying the magnetic field, that is, by changing the magnetic flux enclosed by the circuit."
    },
    {
      "name": "paragraph",
      "body": "It is also possible to explain the motional emf expression in the above equation by invoking the Lorentz force acting on the free charge carriers of conductor \\( PQ \\). Consider any arbitrary charge \\( q \\) in the conductor \\( PQ \\). When the rod moves with speed \\( v \\), the charge will also be moving with speed \\( v \\) in the magnetic field \\( B \\). The Lorentz force on this charge is \\( qvB \\) in magnitude, and its direction is towards \\( Q \\). All charges experience the same force, in magnitude and direction, irrespective of their position in the rod \\( PQ \\)."
    },
    {
      "name": "paragraph",
      "body": "The work done in moving the charge from \\( P \\) to \\( Q \\) is,"
    },
    {
      "name": "expression",
      "body": "\\[ W = qvBl \\]"
    },
    {
      "name": "paragraph",
      "body": "Since emf is the work done per unit charge,"
    },
    {
      "name": "expression",
      "body": "\\[ \\varepsilon = {{W}\\over{q}} = Blv \\]"
    },
    {
      "name": "paragraph",
      "body": "This equation gives emf induced across the rod PQ.On the other hand, it is not obvious how an emf is induced when a conductor is stationary and the magnetic field is changing – a fact which Faraday verified by numerous experiments. In the case of a stationary conductor, the force on its charges is given by"
    },
    {
      "name": "expression",
      "body": "\\[ F = q (E + v \\cdot B) = qE \\]"
    },
    {
      "name": "paragraph",
      "body": "since \\( v = 0 \\). Thus, any force on the charge must arise from the electric field term \\( E \\) alone. Therefore, to explain the existence of induced emf or induced current, we must assume that a time-varying magnetic field generates an electric field."
    }
  ]
}
